---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementBoundarySubface.Dispose
source: html/1c5fecaf-3a51-8d17-8e1b-8dea14350fd3.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.Dispose Method

Releases all resources used by the SpatialElementBoundarySubface

## Syntax (C#)
```csharp
public void Dispose()
```